import React from 'react';

export default function ModalProgram() {
	return (
		<>
			<button
				className="btn mr-2 border-0 bg-blue-500 text-white"
				onClick={() =>
					(
						document.getElementById('my_modal_2') as HTMLDialogElement
					).showModal()
				}
			>
				РЕЧ
			</button>
			<dialog id="my_modal_2" className="modal modal-bottom sm:modal-middle">
				<div className="modal-box bg-gray-600 bg-opacity-80">
					<h3 className="text-md font-bold text-white lg:text-lg">
						ПРЕДИЗБОРНА РЕЧ
					</h3>
					<p className="py-4 text-white">
						Иска ми се да ви кажа няколко думи като кандидат за кмет на община
						Банско. Влязох в политиката в желание да покажа, че може да има
						власт, която се упражнява от човека за хората. Уважавам партиите, но
						не членувам в тях; бил съм в управлението, но не съм зависим от
						него; уверен съм, че мога да помогна, но няма да го направя на всяка
						цена. Решението оставям на вас. През последните 12 години съм бил
						навсякъде – по улиците, ливадите и пътищата, край вадите и мерите,
						при лавините и пожарите! От вашите надежди и болки съм разбрал какво
						е управлението. То е безсмислено без доверието на хората. Учил съм
						се от мнозина, видял съм силните и слабите страни на редица кметове
						съветници и администратори. Ще взема най-доброто от техните
						резултати и ще ги надградя. През всичките години са ме интересували
						единствено онези хора, които могат и искат да работят за община
						Банско. Нямам против да е по техния начин, стига да е почтен и
						ефективен. Идвам да обединявам, а не да воювам. Горд съм, че съм
						роден и израсъл в подножието на Пирина и знам как да увелича славата
						ни на горди и почтени българи. Протегнал съм ръка, защото всеки от
						нас е ценен за бъдещето на община Банско, независимо от кой край и
						отбор идва. Искам крайната победа да е обща и всеки в тази община да
						отнесе част от нея у дома, при семейството и децата си. Нека гледаме
						на бъдещето на община Банско с различни очи, но в една посока. Да
						дадем ново начало на една модерна и обърната към хората,
						благоденстваща и социална, глобална и традиционна – една още
						по-хубава община Банско – такава, каквато искаме да завещаем на
						нашите деца и внуци. <br />
						На добър ни час и победа!
					</p>
					<div className="modal-action">
						<form method="dialog">
							{/* if there is a button in form, it will close the modal */}
							<button className="btn">ЗАТВОРИ</button>
						</form>
					</div>
				</div>
			</dialog>
		</>
	);
}
